In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../../02. Madison Subset/Madison_Reviews.csv")

In [3]:
df.head()

,Unnamed: 0,business_id,funny,useful,review_id,text,stars,date,user_id,cool
0,0,ou3C2Cnot1gitNoQIu5Uag,0,1,SlRqylnJdgId16sDnqpglw,I came here Christmas Day 2017 to grab a few i...,1.0,2018-05-29 09:09:16,InnEjkdcAxD-CCtQTP8EyQ,0
1,1,ou3C2Cnot1gitNoQIu5Uag,0,0,PP8dOxMFX38vgIZnT19C-w,This is Walgreen's - sometimes it has good sal...,3.0,2017-05-13 21:47:26,vAhWqV8pSv3crEdTiaqFVw,0
2,2,ou3C2Cnot1gitNoQIu5Uag,0,1,yo6lp-WrkkagT40eTe7tzw,I simply came to get an OTC item and waited mo...,1.0,2017-10-04 00:10:21,npO5XqgJN3FdVsUx-cAFJw,0
3,3,ou3C2Cnot1gitNoQIu5Uag,0,0,wkI56m5OeJaicdJK6y_g1Q,Hey it's a Walgreen's. \n\nAs I had to tell th...,3.0,2012-02-12 01:29:10,r-zUIQPaHzvIyL93wQaoiQ,0
4,4,ou3C2Cnot1gitNoQIu5Uag,0,1,QMVWX3pVyTUTqi0GZuPbcQ,I know there are a variety of Walgreens in any...,5.0,2017-05-21 19:32:30,xomLWGz8EhYT2cTL1W7FYw,0

In [4]:
df["datetime"] = pd.to_datetime(df["date"])

In [5]:
df["datetime"].describe()

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  """Entry point for launching an IPython kernel.

count                  118125
unique                 118006
top       2014-07-02 01:16:13
freq                        4
first     2005-03-03 19:49:39
last      2019-12-13 15:46:10
Name: datetime, dtype: object

In [6]:
bdf = df.groupby('business_id').max()["datetime"].reset_index(name="Max Date")

In [7]:
bdf["Min Date"] = df.groupby('business_id').min()["datetime"].reset_index(name="Min Date")["Min Date"]

In [8]:
bdf.head()

              business_id            Max Date            Min Date
0  -0b86isaXMY0v4g-V8GZ9Q 2014-12-05 01:50:55 2009-02-09 17:56:01
1  -2Arz8twKJmxHMS3Sv-TeA 2019-10-21 18:34:28 2011-01-07 01:05:11
2  -5DifC-lAFioAD_DLVgTMQ 2019-12-02 21:37:37 2013-02-21 04:15:45
3  -5OGnkKlP5nECa5rp6E1gg 2019-08-06 21:43:39 2011-06-22 18:54:17
4  -64YsJzeTVvOaFDRdU_KxA 2018-04-24 23:32:29 2015-01-13 19:36:48

In [9]:
bdf["Delta"] = bdf["Max Date"] - bdf["Min Date"]

In [10]:
bdf.describe()

                              Delta
count                          3680
mean   2095 days 20:34:18.450815200
std    1315 days 02:05:37.185790672
min                 0 days 13:28:43
25%       1029 days 00:23:51.750000
50%       1922 days 05:48:08.500000
75%              3018 days 06:00:20
max              5392 days 00:57:40

In [11]:
bdf

,business_id,Max Date,Min Date,Delta
0,-0b86isaXMY0v4g-V8GZ9Q,2014-12-05 01:50:55,2009-02-09 17:56:01,2124 days 07:54:54
1,-2Arz8twKJmxHMS3Sv-TeA,2019-10-21 18:34:28,2011-01-07 01:05:11,3209 days 17:29:17
2,-5DifC-lAFioAD_DLVgTMQ,2019-12-02 21:37:37,2013-02-21 04:15:45,2475 days 17:21:52
3,-5OGnkKlP5nECa5rp6E1gg,2019-08-06 21:43:39,2011-06-22 18:54:17,2967 days 02:49:22
4,-64YsJzeTVvOaFDRdU_KxA,2018-04-24 23:32:29,2015-01-13 19:36:48,1197 days 03:55:41
...,...,...,...,...
3675,zsba0Tyt6dm6m9y5qBCxvw,2019-07-15 18:01:31,2013-05-14 17:56:00,2253 days 00:05:31
3676,ztV1Seo1eCp9_ZBcFUvTLw,2019-08-23 22:11:49,2012-04-10 00:45:27,2691 days 21:26:22
3677,zvOkw2USqHHM9b2cpVzQqQ,2018-02-18 22:17:48,2009-08-12 15:55:05,3112 days 06:22:43
3678,zx_eg_zbs2pyDU4QmCXE1Q,2019-03-10 02:53:09,2013-08-15 17:58:23,2032 days 08:54:46
3679,zz4OLlsOlft6RVbixGfwiw,2018-10-15 16:55:33,2013-11-30 04:21:06,1780 days 12:34:27

In [12]:
bdf["Delta"].iloc[0].days

2124

In [13]:
bdf["yelp_lifetime"] = bdf["Delta"].apply(lambda x: x.days / 365.)

In [14]:
bdf.head()

,business_id,Max Date,Min Date,Delta,yelp_lifetime
0,-0b86isaXMY0v4g-V8GZ9Q,2014-12-05 01:50:55,2009-02-09 17:56:01,2124 days 07:54:54,5.819178
1,-2Arz8twKJmxHMS3Sv-TeA,2019-10-21 18:34:28,2011-01-07 01:05:11,3209 days 17:29:17,8.791781
2,-5DifC-lAFioAD_DLVgTMQ,2019-12-02 21:37:37,2013-02-21 04:15:45,2475 days 17:21:52,6.780822
3,-5OGnkKlP5nECa5rp6E1gg,2019-08-06 21:43:39,2011-06-22 18:54:17,2967 days 02:49:22,8.128767
4,-64YsJzeTVvOaFDRdU_KxA,2018-04-24 23:32:29,2015-01-13 19:36:48,1197 days 03:55:41,3.279452

In [15]:
2124/365.

5.8191780821917805

In [16]:
bdf = bdf.drop(["Max Date", "Min Date", "Delta"], axis=1)
bdf.head()

              business_id  yelp_lifetime
0  -0b86isaXMY0v4g-V8GZ9Q       5.819178
1  -2Arz8twKJmxHMS3Sv-TeA       8.791781
2  -5DifC-lAFioAD_DLVgTMQ       6.780822
3  -5OGnkKlP5nECa5rp6E1gg       8.128767
4  -64YsJzeTVvOaFDRdU_KxA       3.279452

In [24]:
rest_df = pd.read_csv("../../02. Madison Subset/MadisonRestaurants.csv")

In [25]:
rest_df.head()

,Unnamed: 0,Unnamed: 0.1,business_id,name,address,city,state,postal_code,latitude,longitude,stars,review_count,is_open,attributes,categories,hours,Restaurant,Food,yelp_lifetime
0,0,387,1BQzXcXFxR6MlVIYmG93kw,Zandru's,419 State St,Madison,WI,53703.0,43.074724,-89.392598,3.5,22,0,"{'RestaurantsGoodForGroups': 'True', 'Restaura...","Spanish, Tapas Bars, Mediterranean, Restaurant...","{'Tuesday': '11:0-23:0', 'Wednesday': '11:0-23...",True,True,0.649315
1,1,463,Iq1P8S3--gqd50xoQJxpqA,Blended,717 Hilldale Way,Madison,WI,53705.0,43.072930,-89.453214,4.5,65,1,"{'BikeParking': 'True', 'HasTV': 'False', 'Res...","Gluten-Free, Specialty Food, Fruits & Veggies,...","{'Monday': '8:0-19:0', 'Tuesday': '8:0-19:0', ...",True,True,3.879452
2,2,2218,nsw3tlB-hwz4KbPYcuaSww,Novanta,8452 Old Sauk Rd,Madison,WI,53562.0,43.075373,-89.529627,4.5,250,1,"{'Ambience': ""{'romantic': False, 'intimate': ...","Mediterranean, Pizza, American (New), Restaura...","{'Monday': '0:0-0:0', 'Tuesday': '11:0-21:0', ...",True,True,6.380822
3,3,2266,cprIQ1e2be5LD7jpPEyiSw,McDonald's,3051 E Washington Ave,Madison,WI,53704.0,43.104087,-89.340903,3.0,7,0,"{'WiFi': ""u'free'"", 'OutdoorSeating': 'False',...","Burgers, Restaurants, Fast Food",NaN,True,True,3.441096
4,4,2531,6yE-QYVLXMZ2DuJmWecjlg,Asian Noodle,902 Regent St,Madison,WI,53715.0,43.067819,-89.401317,4.5,10,1,"{'Ambience': ""{'touristy': False, 'hipster': F...","Restaurants, Asian Fusion, Noodles","{'Monday': '0:0-0:0', 'Tuesday': '11:0-22:0', ...",True,True,0.186301

In [19]:
rest_df = rest_df.merge(bdf, on="business_id")

In [20]:
rest_df.head()

,Unnamed: 0,business_id,name,address,city,state,postal_code,latitude,longitude,stars,review_count,is_open,attributes,categories,hours,Restaurant,Food,yelp_lifetime
0,387,1BQzXcXFxR6MlVIYmG93kw,Zandru's,419 State St,Madison,WI,53703.0,43.074724,-89.392598,3.5,22,0,"{'RestaurantsGoodForGroups': 'True', 'Restaura...","Spanish, Tapas Bars, Mediterranean, Restaurant...","{'Tuesday': '11:0-23:0', 'Wednesday': '11:0-23...",True,True,0.649315
1,463,Iq1P8S3--gqd50xoQJxpqA,Blended,717 Hilldale Way,Madison,WI,53705.0,43.072930,-89.453214,4.5,65,1,"{'BikeParking': 'True', 'HasTV': 'False', 'Res...","Gluten-Free, Specialty Food, Fruits & Veggies,...","{'Monday': '8:0-19:0', 'Tuesday': '8:0-19:0', ...",True,True,3.879452
2,2218,nsw3tlB-hwz4KbPYcuaSww,Novanta,8452 Old Sauk Rd,Madison,WI,53562.0,43.075373,-89.529627,4.5,250,1,"{'Ambience': ""{'romantic': False, 'intimate': ...","Mediterranean, Pizza, American (New), Restaura...","{'Monday': '0:0-0:0', 'Tuesday': '11:0-21:0', ...",True,True,6.380822
3,2266,cprIQ1e2be5LD7jpPEyiSw,McDonald's,3051 E Washington Ave,Madison,WI,53704.0,43.104087,-89.340903,3.0,7,0,"{'WiFi': ""u'free'"", 'OutdoorSeating': 'False',...","Burgers, Restaurants, Fast Food",NaN,True,True,3.441096
4,2531,6yE-QYVLXMZ2DuJmWecjlg,Asian Noodle,902 Regent St,Madison,WI,53715.0,43.067819,-89.401317,4.5,10,1,"{'Ambience': ""{'touristy': False, 'hipster': F...","Restaurants, Asian Fusion, Noodles","{'Monday': '0:0-0:0', 'Tuesday': '11:0-22:0', ...",True,True,0.186301

In [21]:
rest_df.to_csv("../../02. Madison Subset/MadisonRestaurants.csv")